DCL 1 MSG01 CHAR (20) DCL 1 MSG02 CHAR (20) DCL 1 MSG03 CHAR (20) DCL 1 MSG04 CHAR (15) DCL 1 MSG05 CHAR (16) DCL 1 MSG06 CHAR (16) DCL 1 MSG07 CHAR (20) DCL 1 MSG08 CHAR (20) DCL 1 MSG09 CHAR (20) DCL 1 MSG10 CHAR (20) DCL 1 MSG11 CHAR (8) DCL 1 MSG12 CHAR (22) DCL 1 MSG20 CHAR (19) DCL 1 MSG21 CHAR (23) DCL 1 MSG22 CHAR (21) DCL 1 MSG23 CHAR (22) DCL 1 MSG24 CHAR (21) DCL 1 MSG25 CHAR (16) DCL 1 MSG26 CHAR (17) DCL 1 MSG27 CHAR (20) DCL 1 MSG28 CHAR (20) DCL 1 MSG29 CHAR (19) DCL 1 MSG30 CHAR (18) DCL 1 MSG31 CHAR (19) DCL 1 MSG97 CHAR (24) DCL 1 MSG98 CHAR (19) DCL 1 DEST_PORT FIXED BINARY (15) DCL 1 SOCKDESC FIXED BINARY (31) DCL 1 NIFLAGS FIXED BINARY (31) DCL 1 SNAPLEN FIXED BINARY (31) DCL 1 WK1 FIXED BINARY (31) DCL 1 WK2 FIXED BINARY (31) DCL 1 WK3 FIXED BINARY (31) DCL 1 RETLEN FIXED DECIMAL (31) DCL 1 WK_LENGTH FIXED DECIMAL (31) DCL 1 WK_SUBSCRIPT BINARY (1) DCL 1 MSG99 , 3 MSG99_1 CHAR (29) , 3 MSG99_2 CHAR (15) , 3 MSG99_3 PIC '(4)A' 