orgbachelorpli: PACKAGE;
	
	branchproc: PROC;	
		IF (MOD(M,2) = 0) THEN;
	        IF(M=2) THEN;
	          RETURN 0;
	        ELSE
	          RETURN 1;
	        END;
	    END;
	END branchproc;
	
END orgbachelorpli;