orgbachelorpli: PACKAGE;
	DCL var_1 DECIMAL(1);
	DCL var_2 CHAR(5);
	
	proc_1: PROC;
		var_1 = 1;
		var_2 = 'Hello World';	
		RETURN;
	END proc_1;
END orgbachelorpli;