DecimalCheckerNegativeTests: PACKAGE;

	DCL DecimalTest_1 DECIMAL(10);
	
		proc_1: PROC;
			DecimalTest_1 = 'Hello World';
		END proc_1;

END DecimalCheckerNegativeTests;