DecimalCheckerNegativeTests: PACKAGE;

	DCL var_1 DECIMAL(10);
	
		proc_1: PROC;
			var_1 = 'Hello World';
		END proc_1;

END DecimalCheckerNegativeTests;