DCL TEST_1 PICTURE '9,999';
DCL TEST_2 PIC '9,999V99';
DCL TEST_2 PIC 'ZZVZZ';
DCL TEST_3 PIC '9,999,999V99';
DCL TEST_4 PIC '**,999V99';
DCL TEST_5 PIC '99/99/99';
DCL TEST_6 PIC '**/**/**';
DCL TEST_7 PIC '**B**B**';
DCL TEST_8 PIC '9BB9BB9';
DCL TEST_9 PIC '9BB/9BB';